@extends('layouts.app')

@section('content')
    <div class="login">
        <div class="soc">
            <p>Вход через соцсети:</p>
            <div class="soc__box">
                <a href="{{ route('loginGithub', 'vkontakte') }}" class="link__item">
                    <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"
                         width="50" height="50"
                         viewBox="0 0 50 50">
                        <path id="vk" fill="#060608" d="M41,4H9C6.24,4,4,6.24,4,9v32c0,2.76,2.24,5,5,5h32c2.76,0,5-2.24,5-5V9C46,6.24,43.76,4,41,4z M37.72,33l-3.73-0.01 c0,0-0.08,0.01-0.21,0.01c-0.3,0-0.92-0.08-1.65-0.58c-1.31-0.91-2.56-3.17-3.55-3.17c-0.07,0-0.13,0.01-0.19,0.03 c-0.86,0.27-1.12,1.13-1.12,2.18c0,0.37-0.26,0.54-0.96,0.54h-1.93c-2.16,0-4.25-0.05-6.6-2.62c-3.46-3.79-6.7-10.53-6.7-10.53 s-0.18-0.39,0.01-0.62c0.18-0.21,0.6-0.23,0.76-0.23c0.04,0,0.06,0,0.06,0h4c0,0,0.37,0.07,0.64,0.27c0.23,0.17,0.35,0.48,0.35,0.48 s0.68,1.32,1.53,2.81c1.43,2.46,2.2,3.28,2.75,3.28c0.09,0,0.18-0.02,0.27-0.07c0.82-0.45,0.58-4.09,0.58-4.09s0.01-1.32-0.42-1.9 c-0.33-0.46-0.96-0.59-1.24-0.63c-0.22-0.03,0.14-0.55,0.62-0.79c0.62-0.3,1.65-0.36,2.89-0.36h0.6c1.17,0.02,1.2,0.14,1.66,0.25 c1.38,0.33,0.91,1.62,0.91,4.71c0,0.99-0.18,2.38,0.53,2.85c0.05,0.03,0.12,0.05,0.21,0.05c0.46,0,1.45-0.59,3.03-3.26 c0.88-1.52,1.56-3.03,1.56-3.03s0.15-0.27,0.38-0.41c0.22-0.13,0.22-0.13,0.51-0.13h0.03c0.32,0,3.5-0.03,4.2-0.03h0.08 c0.67,0,1.28,0.01,1.39,0.42c0.16,0.62-0.49,1.73-2.2,4.03c-2.82,3.77-3.14,3.49-0.8,5.67c2.24,2.08,2.7,3.09,2.78,3.22 C39.68,32.88,37.72,33,37.72,33z"></path>
                    </svg>
                </a>
                <a href="{{ route('loginGithub', 'github') }}" class="link__item">
                    <svg xmlns="http://www.w3.org/2000/svg"
                         width="44" height="44"
                         viewBox="0 0 25 25">
                        <path id="github" fill="#060608" d="M19 0h-14c-2.761 0-5 2.239-5 5v14c0 2.761 2.239 5 5 5h14c2.762 0 5-2.239 5-5v-14c0-2.761-2.238-5-5-5zm-4.466 19.59c-.405.078-.534-.171-.534-.384v-2.195c0-.747-.262-1.233-.55-1.481 1.782-.198 3.654-.875 3.654-3.947 0-.874-.312-1.588-.823-2.147.082-.202.356-1.016-.079-2.117 0 0-.671-.215-2.198.82-.64-.18-1.324-.267-2.004-.271-.68.003-1.364.091-2.003.269-1.528-1.035-2.2-.82-2.2-.82-.434 1.102-.16 1.915-.077 2.118-.512.56-.824 1.273-.824 2.147 0 3.064 1.867 3.751 3.645 3.954-.229.2-.436.552-.508 1.07-.457.204-1.614.557-2.328-.666 0 0-.423-.768-1.227-.825 0 0-.78-.01-.055.487 0 0 .525.246.889 1.17 0 0 .463 1.428 2.688.944v1.489c0 .211-.129.459-.528.385-3.18-1.057-5.472-4.056-5.472-7.59 0-4.419 3.582-8 8-8s8 3.581 8 8c0 3.533-2.289 6.531-5.466 7.59z"/>
                    </svg>
                </a>
            </div>
            <p>или E-mail:</p>
        </div>
        <form action="{{ route('login') }}" class="form__login" method="POST">
            @csrf
            <div class="form__group">
                <label for="user_email">
                    Email
                </label>
                <input autofocus="autofocus" type="email" name="email" required="required" placeholder="Email">
                @error('email')
                    <span class="error">
                        {{ $message }}
                    </span>
                @enderror
            </div>
            <div class="form__group">
                <label for="password">
                    Пароль
                </label>
                <input type="password" name="password" required placeholder="Пароль">
                @error('password')
                    <span class="error">
                        {{ $message }}
                    </span>
                @enderror
            </div>
            <div class="form__check">
                <input class="form__check__input" type="checkbox" value="1" name="remember" {{ old('remember') ? 'checked' : '' }}>
                <label class="form__check__label" for="check">
                    Запомнить меня
                </label>
            </div>
            <div class="form__submit">
                <button type="submit" class="form__submit__btn">Войти</button>
            </div>
        </form>
    </div>
@endsection
